test/2025-05-21_12-06-29.579074/test-v1.yaml

execution:
  - executor: jmeter   # Especifica que se usará JMeter
    concurrency: 42     # Número de usuarios virtuales concurrentes
    ramp-up: 3s       # Tiempo para alcanzar la concurrencia completa
    scenario: api-test
    iterations: 1   # Número de iteraciones por usuario virtual

scenarios:
  api-test:
    requests:
      - url: http://localhost:8000/v1/inventory
        method: GET
        label: get-inventory
      - url: http://localhost:8000/v1/movies
        method: GET
        label: get-movies
      - url: http://localhost:8000/v1/customers
        method: GET
        label: get-customers

reporting:
  - module: console
  - module: final-stats
    summary: true
    percentiles: true 
    failed-labels: false
    test-duration: true
    dump-csv: ./test/reports/perf_result_csv.csv
  - module: junit-xml
    data-source: pass-fail
    filename: ./test/reports/junit-result.xml
  - module: blazemeter
    report-name: API Performance Test 1
    test: API Test v1
    project: API Testing
    public-report: true
    filename: ./test/reports/junit-result.xml


settings:
  check-interval: 2s  # intervalo para recopilar métricas
  verbose: false      # más detalles en la salida de consola